Core/src/Catalogs/ДЛ_СтатьиУниверсальногоОтчета/ДЛ_СтатьиУниверсальногоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДЛ_СтатьиУниверсальногоОтчета</name>
  <owners>Catalog.ДЛ_ВидыУниверсальныхОтчетов</owners>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФормулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШрифтСтатьи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Источники</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИсточника</name>
      <type>
        <types>EnumRef.ДЛ_ТипыИсточниковДанныхСтатьи</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтборыПоСубконто</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Формулы</name>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/ДЛ_СтатьиУниверсальногоОтчета/Forms/ФормаРедакторФормулы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец = Параметры.Владелец;
	Формула = Параметры.Формула;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодобратьСтатью(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", Владелец);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборСтатьи", ЭтаФорма);
	
	ОткрытьФорму("Справочник.ДЛ_СтатьиУниверсальногоОтчета.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(Формула);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборСтатьи(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		
		Формула = Формула + ПолучитьИдентификаторСтатьиНаСервере(Результат);
		Возврат;
	
	КонецЕсли; 

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторСтатьиНаСервере(Статья)

	Если НЕ ЗначениеЗаполнено(Статья) Тогда
	
		Возврат "";
		
	Иначе
		
		Возврат "[" + Статья.ИдентификаторФормулы + "]";
		
	КонецЕсли; 

КонецФункции // ()
